reports/issue_134_raw_artifacts/raw_results/prefix-repetition-online/8/rep-3/bench.log
/root/vllm/vllm-hust/vllm/__init__.py:7: RuntimeWarning: Failed to read commit hash:
cannot import name '_version' from partially initialized module 'vllm' (most likely due to a circular import) (/root/vllm/vllm-hust/vllm/__init__.py)
  from .version import (  # isort:skip
INFO 08-05 10:12:05 [__init__.py:44] Available plugins for group vllm.platform_plugins:
INFO 08-05 10:12:05 [__init__.py:46] - ascend -> vllm_ascend:register
INFO 08-05 10:12:05 [__init__.py:58] Loading plugin ascend
INFO 08-05 10:12:05 [__init__.py:246] Platform plugin ascend is activated
INFO 08-05 10:12:05 [platform.py:60] Breakable cudagraph is force disabled on Ascend because DeepSeek V4 PIECEWISE cudagraph is not supported yet.
WARNING 08-05 10:12:42 [importing.py:78] Triton is installed, but `triton.backends` could not be imported. Disabling Triton.
INFO 08-05 10:12:42 [importing.py:93] Triton not installed or not compatible; certain GPU-related functions will not be available.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xfffcdd607ec0>, trust_remote_code=False, seed=0, num_prompts=200, dataset_name='prefix_repetition', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=4096, random_output_len=256, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url=None, host='127.0.0.1', port=8422, endpoint='/v1/completions', header=None, max_concurrency=None, model='/data/shared_models/Qwen--Qwen2.5-14B-Instruct', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/data/issue134-results/npu2.tmp/raw_results/prefix-repetition-online/8/rep-3', result_filename='raw.json', ignore_eos=False, self_timed=None, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-54264eb6-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 200/200 [04:38<00:00,  1.39s/it]
Failed requests during benchmark run detected (capping to 10):
Error 0: Traceback (most recent call last):
  File "/root/miniconda3/envs/vllm-hust-dev/lib/python3.11/asyncio/selector_events.py", line 999, in _read_ready__data_received
    data = self._sock.recv(self.max_size)
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
ConnectionResetError: [Errno 104] Connection reset by peer

The above exception was the direct cause of the following exception:

Traceback (most recent call last):
  File "/root/vllm/vllm-hust/vllm/benchmarks/lib/endpoint_request_func.py", line 217, in async_request_openai_completions
    async with session.post(url=api_url, json=payload, headers=headers) as response:
  File "/root/miniconda3/envs/vllm-hust-dev/lib/python3.11/site-packages/aiohttp/client.py", line 1693, in __aenter__
    self._resp: _RetType_co = await self._coro
                              ^^^^^^^^^^^^^^^^
  File "/root/miniconda3/envs/vllm-hust-dev/lib/python3.11/site-packages/aiohttp/client.py", line 858, in _request
    resp = await handler(req)
           ^^^^^^^^^^^^^^^^^^
  File "/root/miniconda3/envs/vllm-hust-dev/lib/python3.11/site-packages/aiohttp/client.py", line 836, in _connect_and_send_request
    await resp.start(conn)
  File "/root/miniconda3/envs/vllm-hust-dev/lib/python3.11/site-packages/aiohttp/client_reqrep.py", line 558, in start
    message, payload = await protocol.read()  # type: ignore[union-attr]
                       ^^^^^^^^^^^^^^^^^^^^^
  File "/root/miniconda3/envs/vllm-hust-dev/lib/python3.11/site-packages/aiohttp/streams.py", line 705, in read
    await self._waiter
aiohttp.client_exceptions.ClientOSError: [Errno 104] Connection reset by peer

tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     199       
Failed requests:                         1         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  278.27    
Total input tokens:                      101897    
Total generated tokens:                  25076     
Request throughput (req/s):              0.72      
Output token throughput (tok/s):         90.11     
Peak output token throughput (tok/s):    205.00    
Peak concurrent requests:                77.00     
Total token throughput (tok/s):          456.29    
---------------Time to First Token----------------
Mean TTFT (ms):                          1266.03   
Median TTFT (ms):                        1270.70   
P99 TTFT (ms):                           1702.69   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          539.26    
Median TPOT (ms):                        532.18    
P99 TPOT (ms):                           607.69    
---------------Inter-token Latency----------------
Mean ITL (ms):                           539.38    
Median ITL (ms):                         607.10    
P99 ITL (ms):                            689.73    
==================================================